#include <stdio.h>

int main(void)
{
	int i, j;
	// 이중 배열
	// 실제 이들은 차원을 가지고 있지 않으며 순차적으로 배치되어 있다.

	//      [0]           [1]
	// [0][0] [0][1] [1][0] [1][1]
	//   0      20     10     30
	int arr[2][2];

	//          [0]                  [1]                  [2]
	// [0][0] [0][1] [0][2] [1][0] [1][1] [1][2] [2][0] [2][1] [2][2]
	int arr2[3][3];

	//             [0]                         [1]
	// [0][0] [0][1] [0][2] [0][3] [1][0] [1][1] [1][2] [1][3]
	int arr3[2][4];

	for (i = 0; i < 2; i++)
	{
		for (j = 0; j < 2; j++)
		{
			arr[i][j] = i * 10 + j * 20;
			printf("arr[%d][%d] = %d\n", i, j, arr[i][j]);
		}
	}

	return 0;
}
